IDEA StatiCa Open Model
CrossSectionComponentEdges.EdgeIndexes Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of zero based edge indexes of component
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<int> EdgeIndexes { get; set; }
Public Property EdgeIndexes As List(Of Integer)
	Get
	Set
public:
property List<int>^ EdgeIndexes {
	List<int>^ get ();
	void set (List<int>^ value);
}
Property Value
Type: List<Int32>
See Also
Reference
CrossSectionComponentEdges Class
IdeaRS.OpenModel.Loading Namespace